RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_features.h
    /* @brief Has LPUART0 clock source selection (register bit SOPT2[LPUART0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_LPUART0SRC (0)
    /* @brief Has LPUART1 clock source selection (register bit SOPT2[LPUART1SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_LPUART1SRC (0)
    /* @brief Has FLEXIOSRC clock source selection (register bit SOPT2[FLEXIOSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_FLEXIOSRC (0)
    /* @brief Has UART0 clock source selection (register bit SOPT2[UART0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_UART0SRC (0)
    /* @brief Has TPM clock source selection (register bit SOPT2[TPMSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPMSRC (0)
    /* @brief Has debug trace clock selection (register bit SOPT2[TRACECLKSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TRACE_CLKSEL (1)
    /* @brief Number of ADC modules (register bits SOPT7[ADCnTRGSEL], SOPT7[ADCnPRETRGSEL], SOPT7[ADCnALTTRGSEL], where n is a module instance index). */
    #define FSL_FEATURE_SIM_OPT_ADC_COUNT (2)
    /* @brief Has clock 2 output divider (register bit field CLKDIV1[OUTDIV2]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV2 (1)
    /* @brief Has clock 3 output divider (register bit field CLKDIV1[OUTDIV3]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV3 (0)
    /* @brief Has clock 4 output divider (register bit field CLKDIV1[OUTDIV4]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV4 (1)
    /* @brief Clock 4 output divider width (width of register bit field CLKDIV1[OUTDIV4]). */
    #define FSL_FEATURE_SIM_DIVIDER_OUTDIV4_WIDTH (4)
    /* @brief Has clock 5 output divider (register bit field CLKDIV1[OUTDIV5]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV5 (0)
    /* @brief Has USB clock divider (register bit field CLKDIV2[USBDIV] and CLKDIV2[USBFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_USBDIV (1)
    /* @brief Has USB FS clock divider (register bit field CLKDIV2[USBFSDIV] and CLKDIV2[USBFSFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_USBFSDIV (0)
    /* @brief Has USB HS clock divider (register bit field CLKDIV2[USBHSDIV] and CLKDIV2[USBHSFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_USBHSDIV (0)
    /* @brief Has PLL/FLL clock divider (register bit field CLKDIV3[PLLFLLDIV] and CLKDIV3[PLLFLLFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_PLLFLLDIV (0)
    /* @brief Has LCDC clock divider (register bit field CLKDIV3[LCDCDIV] and CLKDIV3[LCDCFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_LCDCDIV (0)
    /* @brief Has trace clock divider (register bit field CLKDIV4[TRACEDIV] and CLKDIV4[TRACEFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_TRACEDIV (0)
    /* @brief Has NFC clock divider (register bit field CLKDIV4[NFCDIV] and CLKDIV4[NFCFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_NFCDIV (0)
    /* @brief Has Kinetis family ID (register bit field SDID[FAMILYID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_FAMILYID (0)
    /* @brief Has Kinetis family ID (register bit field SDID[FAMID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_FAMID (1)
    /* @brief Has Kinetis sub-family ID (register bit field SDID[SUBFAMID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_SUBFAMID (0)
    /* @brief Has Kinetis series ID (register bit field SDID[SERIESID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_SERIESID (0)
    /* @brief Has device die ID (register bit field SDID[DIEID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_DIEID (0)
    /* @brief Has system SRAM size specifier (register bit field SDID[SRAMSIZE]). */
    #define FSL_FEATURE_SIM_SDID_HAS_SRAMSIZE (0)
    /* @brief Has flash mode (register bit FCFG1[FLASHDOZE]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_FLASHDOZE (1)
    /* @brief Has flash disable (register bit FCFG1[FLASHDIS]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_FLASHDIS (1)
    /* @brief Has FTFE disable (register bit FCFG1[FTFDIS]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_FTFDIS (0)
    /* @brief Has FlexNVM size specifier (register bit field FCFG1[NVMSIZE]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_NVMSIZE (1)
    /* @brief Has EEPROM size specifier (register bit field FCFG1[EESIZE]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_EESIZE (1)
    /* @brief Has FlexNVM partition (register bit field FCFG1[DEPART]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_DEPART (1)
    /* @brief Maximum flash address block 0 address specifier (register bit field FCFG2[MAXADDR0]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR0 (1)
    /* @brief Maximum flash address block 1 address specifier (register bit field FCFG2[MAXADDR1]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR1 (1)
    /* @brief Maximum flash address block 0 or 1 address specifier (register bit field FCFG2[MAXADDR01]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR01 (0)
    /* @brief Maximum flash address block 2 or 3 address specifier (register bit field FCFG2[MAXADDR23]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR23 (0)
    /* @brief Has program flash availability specifier (register bit FCFG2[PFLSH]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_PFLSH (1)
    /* @brief Has program flash swapping (register bit FCFG2[SWAPPFLSH]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_PFLSH_SWAP (1)
    /* @brief Has miscellanious control register (register MCR). */
    #define FSL_FEATURE_SIM_HAS_MISC_CONTROLS (0)
    /* @brief Has COP watchdog (registers COPC and SRVCOP). */
    #define FSL_FEATURE_SIM_HAS_COP_WATCHDOG (0)
    /* @brief Has COP watchdog stop (register bits COPC[COPSTPEN], COPC[COPDBGEN] and COPC[COPCLKSEL]). */
    #define FSL_FEATURE_SIM_HAS_COP_STOP (0)
    /* @brief Has LLWU clock gate bit (e.g SIM_SCGC4). */
    #define FSL_FEATURE_SIM_HAS_SCGC_LLWU (1)
#endif

/* SMC module features */

/* @brief Has partial stop option (register bit STOPCTRL[PSTOPO]). */
#define FSL_FEATURE_SMC_HAS_PSTOPO (0)
/* @brief Has LPO power option (register bit STOPCTRL[LPOPO]). */
#define FSL_FEATURE_SMC_HAS_LPOPO (0)
/* @brief Has POR power option (register bit STOPCTRL[PORPO] or VLLSCTRL[PORPO]). */
#define FSL_FEATURE_SMC_HAS_PORPO (0)
/* @brief Has low power wakeup on interrupt (register bit PMCTRL[LPWUI]). */
#define FSL_FEATURE_SMC_HAS_LPWUI (1)
/* @brief Has LLS or VLLS mode control (register bit STOPCTRL[LLSM]). */
#define FSL_FEATURE_SMC_HAS_LLS_SUBMODE (0)
/* @brief Has VLLS mode control (register bit VLLSCTRL[VLLSM]). */
#define FSL_FEATURE_SMC_USE_VLLSCTRL_REG (1)
/* @brief Has VLLS mode control (register bit STOPCTRL[VLLSM]). */
#define FSL_FEATURE_SMC_USE_STOPCTRL_VLLSM (0)
/* @brief Has RAM partition 2 power option (register bit STOPCTRL[RAM2PO]). */
#define FSL_FEATURE_SMC_HAS_RAM2_POWER_OPTION (0)
/* @brief Has high speed run mode (register bit PMPROT[AHSRUN]). */
#define FSL_FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE (0)
/* @brief Has low leakage stop mode (register bit PMPROT[ALLS]). */
#define FSL_FEATURE_SMC_HAS_LOW_LEAKAGE_STOP_MODE (1)
/* @brief Has stop submode 0(VLLS0). */
#define FSL_FEATURE_SMC_HAS_STOP_SUBMODE0 (0)
/* @brief Has stop submode 2(VLLS2). */
#define FSL_FEATURE_SMC_HAS_STOP_SUBMODE2 (1)

/* DSPI module features */

#if defined(CPU_MK51DN256CMD10) || defined(CPU_MK51DN512CMD10) || defined(CPU_MK51DN256CLQ10) || defined(CPU_MK51DN512CLQ10) || \
    defined(CPU_MK51DX256CLL10) || defined(CPU_MK51DN512CLL10) || defined(CPU_MK51DX256CMC10) || defined(CPU_MK51DN512CMC10)
    /* @brief Receive/transmit FIFO size in number of items. */
    #define FSL_FEATURE_DSPI_FIFO_SIZE (4)
    #define FSL_FEATURE_DSPI_FIFO_SIZEx { 4, 4, 4 }
    /* @brief Maximum transfer data width in bits. */
    #define FSL_FEATURE_DSPI_MAX_DATA_WIDTH (16)
    /* @brief Maximum number of chip select pins. (Reflects the width of register bit field PUSHR[PCS].) */
    #define FSL_FEATURE_DSPI_MAX_CHIP_SELECT_COUNT (6)
    /* @brief Number of chip select pins. */
    #define FSL_FEATURE_DSPI_CHIP_SELECT_COUNT (6)
    /* @brief Has chip select strobe capability on the PCS5 pin. */
    #define FSL_FEATURE_DSPI_HAS_CHIP_SELECT_STROBE (1)
    /* @brief Has separated TXDATA and CMD FIFOs (register SREX). */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_TXDATA_CMD_FIFO (0)
    /* @brief Has 16-bit data transfer support. */
    #define FSL_FEATURE_DSPI_16BIT_TRANSFERS (1)
    /* @brief Has separate DMA RX and TX requests. */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(x) \
        ((x) == 0 ? (1) : \
        ((x) == 1 ? (1) : \
        ((x) == 2 ? (1) : (-1))))
#elif defined(CPU_MK51DX256CLK10)
    /* @brief Receive/transmit FIFO size in number of items. */
    #define FSL_FEATURE_DSPI_FIFO_SIZE (4)
    #define FSL_FEATURE_DSPI_FIFO_SIZEx { 4, 4 }
    /* @brief Maximum transfer data width in bits. */
    #define FSL_FEATURE_DSPI_MAX_DATA_WIDTH (16)
    /* @brief Maximum number of chip select pins. (Reflects the width of register bit field PUSHR[PCS].) */
    #define FSL_FEATURE_DSPI_MAX_CHIP_SELECT_COUNT (6)
    /* @brief Number of chip select pins. */
    #define FSL_FEATURE_DSPI_CHIP_SELECT_COUNT (5)
    /* @brief Has chip select strobe capability on the PCS5 pin. */
    #define FSL_FEATURE_DSPI_HAS_CHIP_SELECT_STROBE (1)
    /* @brief Has separated TXDATA and CMD FIFOs (register SREX). */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_TXDATA_CMD_FIFO (0)
    /* @brief Has 16-bit data transfer support. */
    #define FSL_FEATURE_DSPI_16BIT_TRANSFERS (1)
    /* @brief Has separate DMA RX and TX requests. */
    #define FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(x) \
        ((x) == 0 ? (1) : \
        ((x) == 1 ? (1) : (-1)))
#endif

/* SysTick module features */

/* @brief Systick has external reference clock. */
#define FSL_FEATURE_SYSTICK_HAS_EXT_REF (0)
/* @brief Systick external reference clock is core clock divided by this value. */
#define FSL_FEATURE_SYSTICK_EXT_REF_CORE_DIV (0)

/* TSI module features */

/* @brief TSI module version. */
#define FSL_FEATURE_TSI_VERSION (2)
/* @brief Has end-of-scan DMA transfer request enable (register bit GENCS[EOSDMEO]). */
#define FSL_FEATURE_TSI_HAS_END_OF_SCAN_DMA_ENABLE (0)
/* @brief Number of TSI channels. */
#define FSL_FEATURE_TSI_CHANNEL_COUNT (16)

/* UART module features */

